#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Розробити функцію super_fibonacci(n, m),
яка приймає 2 аргументи -- додатні цілі числа n та m (0 < n, m <= 35),
та повертає число -- n-й елемент послідовності супер-Фібоначчі порядку m.

Нагадуємо, що послідовність Фібоначчі -- це послідовність чисел, в якій кожний елемент дорівнює сумі двох попередніх. Послідовністю супер-Фібоначчі порядку m будемо вважати таку послідовність чисел, в якій кожний елемент дорівнює сумі m попередніх. Перші m елементів (з порядковими номерами від 1 до m) вважатимемо одиницями.
"""
def super_fibonacci(n, m):
	fib_num = []
	for i in range(n):
		if i >= m:
			fib_num.append(sum(fib_num[-m:]))
		else:
			fib_num.append(1)
	return fib_num[n - 1]
