#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Розробити функцію encode_morze(text),
яка приймає 1 аргумент -- рядок,
та повертає рядок, який містить діаграму сигналу, що відповідає переданому тексту, закодованому міжнародним кодом Морзе для англійського алфавіту. Розділові та інші знаки, що не входять до латинського алфавіту, ігнорувати. Регістром літер нехтувати.

Для передачі повідомлення за одиницю часу приймається тривалість однієї крапки. Тривалість тире дорівнює трьом крапкам. Пауза між елементами одного знака -- одна крапка, між знаками в слові -- 3 крапки, між словами -- 7 крапок. Словом вважати послідовність символів, обмежена пробілами. Результуюча "діаграма" демонструє наявність сигналу в кожний проміжок часу: на і-й позиції знаходиться "^", якщо в цей момент передається сигнал, і "_", якщо сигналу немає. Зайві паузи в кінці повідомлення на "діаграмі" відсутні.
"""
def encode_morze(text):
	morse_code = {
    "A" : ".-", 
    "B" : "-...", 
    "C" : "-.-.", 
    "D" : "-..", 
    "E" : ".", 
    "F" : "..-.", 
    "G" : "--.", 
    "H" : "....", 
    "I" : "..", 
    "J" : ".---", 
    "K" : "-.-", 
    "L" : ".-..", 
    "M" : "--", 
    "N" : "-.", 
    "O" : "---", 
    "P" : ".--.", 
    "Q" : "--.-", 
    "R" : ".-.", 
    "S" : "...", 
    "T" : "-", 
    "U" : "..-", 
    "V" : "...-", 
    "W" : ".--", 
    "X" : "-..-", 
    "Y" : "-.--", 
    "Z" : "--..",
	" " : "_"
		}
	morse_simbol = {
		"." : "^",
		"-" : "^^^",
		" " : "_",
		"_" : "_",
		"___" : "_____"
			}
	p = ''
	encode = ''
	morze_list = morse_code.keys()
	simbol = morse_simbol.keys()
	text_morze = text.upper()
	for i in text_morze:
		if i in morze_list:	
			p = p + "_" + morse_code[i]
	p = p[1: ]
	for j in p:
		if j in simbol:
			encode = encode + "_" +  morse_simbol[j]
	encode = encode[1: ]
	return encode
