#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Завдання передбачає пошук "щасливих" квитків. "Щасливим" називається такий тролейбусний квиток, в якому сума перших трьох цифр дорівнює сумі останніх трьох. Наприклад 030111 (0+3+0 = 1+1+1), 902326 (9+0+2 = 3+2+6), 001100 (0+0+1 = 1+0+0).

Вхідні дані: два цілих невід'ємних числа (0<=a1<=a2<=999999) - аргументи командного рядка.

Результат роботи: кількість "щасливих квитків", чиї номери лежать на проміжку від a1 до a2 включно. Якщо число на проміжку має менше 6 розрядів, вважати, що на його початку дописуються нулі у необхідній кількості, як це і відбувається при нумерації квитків. Виводити номери квитків не треба.
"""
import sys
a1 = int(sys.argv[1])
a2 = int(sys.argv[2])

if a1 < 0:
	print a1, ":must be not less 0!"
if a2 < 0:
	print a2, ":must be not less 0!"

k = "%06d" % a1
l = "%06d" % a2
summ = 0
su = 0
j = 0

while a1 <= a2:
	k = "%06d" % a1
	#print k
	for i in range(len(k)/2):
		summ = int(k[i]) + summ
	#print  k, sum
	for m in range(len(k)/2):
		m = m + 1
		su = int(k[-m]) + su
	#print k, sum, su
	if summ == su:
		j = j + 1
		#print k,
	summ = 0
	su = 0
	a1 = a1 + 1
print j
