#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Розробити функцію clean_list(list_to_clean),
яка приймає 1 аргумент -- список будь-яких значень (рядків, цілих та дійсних чисел) довільної довжини,
та повертає список, який складається з тих самих значень, але не містить повторів елементів. Це значить, що у випадку наявності значення в початковому списку в кількох екземплярах перший "екземпляр" значення залишається на своєму місці, а другий, третій та ін. видаляються.
"""

def clean_list(list_to_clean):
	result = []
	for i in list_to_clean:
		flag = False 
		for j in result:
			if i == j and str(i)== str(j):
				flag = True
		if not flag:
			result.append(i)		
	return result

