#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Вхідні дані: рядок, що складається з відкриваючих та закриваючих круглих дужок - аргумент командного рядка. Для передачі в якості рядка послідовність береться в подвійні лапки.

Результат роботи: рядок "YES", якщо вхідний рядок містить правильну дужкову послідовність; або рядок "NO", якщо послідовність є неправильною. Дужкова послідовність вважається правильною, якщо всі дужки можна розбити попарно "відкриваюча"-"закриваюча", при чому в кожній парі закриваюча дужка слідує після відкриваючої.

Пояснення для математиків:
"" (порожній рядок) - правильна дужкова послідовність (ПДП)
"(ПДП)" - також ПДП
"ПДППДП" (дві ПДП записані поряд) - також ПДП
"""
import sys
import re
row = sys.argv[1]
k = 0
n = 0
if row[0] == ')':
	print "NO"
else:
	for i in row:
		if i == ')':
			k = k +1
		
		elif i == '(':
			n = n + 1
	if k == n:
		print "YES"
	else:
		print "NO"
