#!usr/bin/python
#-*- coding: utf-8 -*-
"""
Вхідні дані: рядок, передається в програму як аргумент командного рядка. Може містити пробіли, літери латинського алфавіту в будь-якому регістрі та цифри. Для передачі одним значенням рядок, що містить пробіли, береться в подвійні лапки.

Результат роботи: рядок "YES", якщо отриманий рядок є паліндромом, або "NO" - якщо ні. Рядок вважається паліндромом, якщо він однаково читається як зліва направо, так і справа наліво. Відмінністю регістрів та пробілами знехтувати.
"""
import sys
import re
raw = sys.argv[1]
raw = re.sub('[^a-z0-9\-\_]','',raw.strip(' ').lower())
if raw == raw[::-1]:
	print "YES"
else:
	print "NO"
